DigitalCodesign/Digital-Codesign-Boards/hardware/esp32/1.0.0/boards.txt
# Official Espressif options
menu.UploadSpeed=Upload Speed
menu.USBMode=USB Mode
menu.CDCOnBoot=USB CDC On Boot
menu.MSCOnBoot=USB Firmware MSC On Boot
menu.DFUOnBoot=USB DFU On Boot
menu.UploadMode=Upload Mode
menu.CPUFreq=CPU Frequency
menu.FlashFreq=Flash Frequency
menu.FlashMode=Flash Mode
menu.FlashSize=Flash Size
menu.PartitionScheme=Partition Scheme
menu.DebugLevel=Core Debug Level
menu.PSRAM=PSRAM
menu.LoopCore=Arduino Runs On
menu.EventsCore=Events Run On
menu.MemoryType=Memory Type
menu.EraseFlash=Erase All Flash Before Sketch Upload
menu.JTAGAdapter=JTAG Adapter
menu.ZigbeeMode=Zigbee Mode
menu.PinNumbers=Pin Numbering

# Custom options
menu.Revision=Board Revision
menu.LORAWAN_REGION=LoRaWan Region
menu.LoRaWanDebugLevel=LoRaWan Debug Level
menu.LORAWAN_DEVEUI=LoRaWan DevEUI
menu.LORAWAN_PREAMBLE_LENGTH=LoRaWan Preamble Length
menu.SLOW_CLK_TPYE=Slow Clk Type(only for LoRaWAN)
menu.einksize=E-Ink Display Size
menu.NetworkLogLevel=Network Log Level
##############################################################
### DO NOT PUT BOARDS ABOVE THE OFFICIAL ESPRESSIF BOARDS! ###
##############################################################

# Generic definition to be used for USB discovery of CDC/JTAG
esp32_family.name=ESP32 Family Device
esp32_family.hide=true
esp32_family.vid.0=0x303a
esp32_family.pid.0=0x1001
esp32_family.upload_port.0.vid=0x303a
esp32_family.upload_port.0.pid=0x1001
esp32_family.build.board=ESP32_FAMILY

##############################################################

dc_esp32.name=ESP32 Core

dc_esp32.bootloader.tool=esptool_py
dc_esp32.bootloader.tool.default=esptool_py

dc_esp32.upload.tool=esptool_py
dc_esp32.upload.tool.default=esptool_py
dc_esp32.upload.tool.network=esp_ota

dc_esp32.upload.maximum_size=1310720
dc_esp32.upload.maximum_data_size=327680
dc_esp32.upload.flags=
dc_esp32.upload.extra_flags=

dc_esp32.serial.disableDTR=true
dc_esp32.serial.disableRTS=true

dc_esp32.build.tarch=xtensa
dc_esp32.build.bootloader_addr=0x1000
dc_esp32.build.target=esp32
dc_esp32.build.mcu=esp32
dc_esp32.build.core=esp32
dc_esp32.build.variant=dc_esp32
dc_esp32.build.board=ESP32_WROOM_DA

dc_esp32.build.f_cpu=240000000L
dc_esp32.build.flash_size=4MB
dc_esp32.build.flash_freq=40m
dc_esp32.build.flash_mode=dio
dc_esp32.build.boot=dio
dc_esp32.build.partitions=default
dc_esp32.build.defines=
dc_esp32.build.loop_core=
dc_esp32.build.event_core=

dc_esp32.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
dc_esp32.menu.PartitionScheme.default.build.partitions=default
dc_esp32.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
dc_esp32.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
dc_esp32.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
dc_esp32.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
dc_esp32.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
dc_esp32.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
dc_esp32.menu.PartitionScheme.minimal.build.partitions=minimal
dc_esp32.menu.PartitionScheme.no_fs=No FS 4MB (2MB APP x2)
dc_esp32.menu.PartitionScheme.no_fs.build.partitions=no_fs
dc_esp32.menu.PartitionScheme.no_fs.upload.maximum_size=2031616
dc_esp32.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
dc_esp32.menu.PartitionScheme.no_ota.build.partitions=no_ota
dc_esp32.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
dc_esp32.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
dc_esp32.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
dc_esp32.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
dc_esp32.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
dc_esp32.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
dc_esp32.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
dc_esp32.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
dc_esp32.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
dc_esp32.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
dc_esp32.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
dc_esp32.menu.PartitionScheme.huge_app.build.partitions=huge_app
dc_esp32.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
dc_esp32.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
dc_esp32.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
dc_esp32.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
dc_esp32.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
dc_esp32.menu.PartitionScheme.fatflash.build.partitions=ffat
dc_esp32.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
dc_esp32.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
dc_esp32.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
dc_esp32.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
dc_esp32.menu.PartitionScheme.rainmaker=RainMaker 4MB
dc_esp32.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
dc_esp32.menu.PartitionScheme.rainmaker.upload.maximum_size=1966080
dc_esp32.menu.PartitionScheme.rainmaker_4MB=RainMaker 4MB No OTA
dc_esp32.menu.PartitionScheme.rainmaker_4MB.build.partitions=rainmaker_4MB_no_ota
dc_esp32.menu.PartitionScheme.rainmaker_4MB.upload.maximum_size=4038656
dc_esp32.menu.PartitionScheme.rainmaker_8MB=RainMaker 8MB
dc_esp32.menu.PartitionScheme.rainmaker_8MB.build.partitions=rainmaker_8MB
dc_esp32.menu.PartitionScheme.rainmaker_8MB.upload.maximum_size=4116480
dc_esp32.menu.PartitionScheme.custom=Custom
dc_esp32.menu.PartitionScheme.custom.build.partitions=
dc_esp32.menu.PartitionScheme.custom.upload.maximum_size=16777216

dc_esp32.menu.CPUFreq.240=240MHz (WiFi/BT)
dc_esp32.menu.CPUFreq.240.build.f_cpu=240000000L
dc_esp32.menu.CPUFreq.160=160MHz (WiFi/BT)
dc_esp32.menu.CPUFreq.160.build.f_cpu=160000000L
dc_esp32.menu.CPUFreq.80=80MHz (WiFi/BT)
dc_esp32.menu.CPUFreq.80.build.f_cpu=80000000L
dc_esp32.menu.CPUFreq.40=40MHz (40MHz XTAL)
dc_esp32.menu.CPUFreq.40.build.f_cpu=40000000L
dc_esp32.menu.CPUFreq.26=26MHz (26MHz XTAL)
dc_esp32.menu.CPUFreq.26.build.f_cpu=26000000L
dc_esp32.menu.CPUFreq.20=20MHz (40MHz XTAL)
dc_esp32.menu.CPUFreq.20.build.f_cpu=20000000L
dc_esp32.menu.CPUFreq.13=13MHz (26MHz XTAL)
dc_esp32.menu.CPUFreq.13.build.f_cpu=13000000L
dc_esp32.menu.CPUFreq.10=10MHz (40MHz XTAL)
dc_esp32.menu.CPUFreq.10.build.f_cpu=10000000L

dc_esp32.menu.FlashMode.qio=QIO
dc_esp32.menu.FlashMode.qio.build.flash_mode=dio
dc_esp32.menu.FlashMode.qio.build.boot=qio
dc_esp32.menu.FlashMode.dio=DIO
dc_esp32.menu.FlashMode.dio.build.flash_mode=dio
dc_esp32.menu.FlashMode.dio.build.boot=dio

dc_esp32.menu.FlashFreq.80=80MHz
dc_esp32.menu.FlashFreq.80.build.flash_freq=80m
dc_esp32.menu.FlashFreq.40=40MHz
dc_esp32.menu.FlashFreq.40.build.flash_freq=40m

dc_esp32.menu.FlashSize.4M=4MB (32Mb)
dc_esp32.menu.FlashSize.4M.build.flash_size=4MB
dc_esp32.menu.FlashSize.8M=8MB (64Mb)
dc_esp32.menu.FlashSize.8M.build.flash_size=8MB
dc_esp32.menu.FlashSize.16M=16MB (128Mb)
dc_esp32.menu.FlashSize.16M.build.flash_size=16MB

dc_esp32.menu.UploadSpeed.921600=921600
dc_esp32.menu.UploadSpeed.921600.upload.speed=921600
dc_esp32.menu.UploadSpeed.115200=115200
dc_esp32.menu.UploadSpeed.115200.upload.speed=115200
dc_esp32.menu.UploadSpeed.256000.windows=256000
dc_esp32.menu.UploadSpeed.256000.upload.speed=256000
dc_esp32.menu.UploadSpeed.230400.windows.upload.speed=256000
dc_esp32.menu.UploadSpeed.230400=230400
dc_esp32.menu.UploadSpeed.230400.upload.speed=230400
dc_esp32.menu.UploadSpeed.460800.linux=460800
dc_esp32.menu.UploadSpeed.460800.macosx=460800
dc_esp32.menu.UploadSpeed.460800.upload.speed=460800
dc_esp32.menu.UploadSpeed.512000.windows=512000
dc_esp32.menu.UploadSpeed.512000.upload.speed=512000

dc_esp32.menu.LoopCore.1=Core 1
dc_esp32.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
dc_esp32.menu.LoopCore.0=Core 0
dc_esp32.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

dc_esp32.menu.EventsCore.1=Core 1
dc_esp32.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
dc_esp32.menu.EventsCore.0=Core 0
dc_esp32.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

dc_esp32.menu.DebugLevel.none=None
dc_esp32.menu.DebugLevel.none.build.code_debug=0
dc_esp32.menu.DebugLevel.error=Error
dc_esp32.menu.DebugLevel.error.build.code_debug=1
dc_esp32.menu.DebugLevel.warn=Warn
dc_esp32.menu.DebugLevel.warn.build.code_debug=2
dc_esp32.menu.DebugLevel.info=Info
dc_esp32.menu.DebugLevel.info.build.code_debug=3
dc_esp32.menu.DebugLevel.debug=Debug
dc_esp32.menu.DebugLevel.debug.build.code_debug=4
dc_esp32.menu.DebugLevel.verbose=Verbose
dc_esp32.menu.DebugLevel.verbose.build.code_debug=5

dc_esp32.menu.EraseFlash.none=Disabled
dc_esp32.menu.EraseFlash.none.upload.erase_cmd=
dc_esp32.menu.EraseFlash.all=Enabled
dc_esp32.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################
